import ComponentGenerator from '../../../../components/ComponentGenerator';
import ComplexThreeHorizontalBoxComponent from '../../../../components/DynamicComponents/ComplexThreeHorizontalBox copy';
import { defaultImagePath } from '../../../../constants';

export default function ResearchDepartmentPage() {
  const contentData = [
    {
      id: '0',
      component: 'HalfSlider',
      isHero: true,
      title: 'معاونت پژوهش',
      slides: [
        '/Images/Slider/3.png',
        '/Images/Slider/5.png',
        '/Images/Slider/2.png',
        '/Images/Slider/4.png',
      ],
    },
    {
      id: '0_1',
      component: 'Features',
      isHero: true,
      title: '',
      items: [
        {
          name: 'سامانه آموزش بهستان',
          image: '/images/Features/1.svg',
        },
        {
          name: 'سامانه کتابخانه',
          image: '/images/Features/2.svg',
        },
        {
          name: 'صندوق رفاه دانشجویی',
          image: '/images/Features/3.svg',
        },
        {
          name: 'سامانه تغذیه',
          image: '/images/Features/4.svg',
        },
        {
          name: 'تقویم تحصیلی',
          image: '/images/Features/5.svg',
        },
        {
          name: 'سامانه آموزش بهستان',
          image: '/images/Features/1.svg',
        },
        {
          name: 'سامانه کتابخانه',
          image: '/images/Features/2.svg',
        },
        {
          name: 'صندوق رفاه دانشجویی',
          image: '/images/Features/3.svg',
        },
        {
          name: 'سامانه تغذیه',
          image: '/images/Features/4.svg',
        },
        {
          name: 'تقویم تحصیلی',
          image: '/images/Features/5.svg',
        },
      ],
    },
    {
      id: '1',
      type: 'horizontal',
      component: 'LastNews',
      header: {
        title: 'آخرین اخبار دانشگاه',
        description: 'برای اطلاع از آخرین اخبار به پرتال خبری دانشگاه مراجعه کنید.',
        portalLink: '#',
      },
      news: [
        {
          type: 'featured',
          title:
            'رونمایی کتاب «کتاب شناسی اختصاصی غزه» به اهتمام دکتر سیدحجت الحق حسینی استاد دانشگاه صنعتی خواجه نصیرالدین طوسی',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، رونمایی کتاب «کتاب شناسی اختصاصی غزه» به اهتمام دکتر سیدحجت الحق حسینی استاد دانشگاه صنعتی خواجه نصیرالدین طوسی در تالار همایش های کوثر برگزار گردید.',
          imageSrc: defaultImagePath,
          imageAlt: 'کتاب شناسی اختصاصی غزه',
        },
        {
          type: 'regular',
          title: 'دانشجویان دانشگاه تراز انقلاب باید پژوهشگر باشند.',
          description:
            'دکتر قیدانی رئیس دانشگاه جامع انقلاب اسلامی در شورای پژوهشی دانشگاه مطرح کرد...',
          imageSrc: defaultImagePath,
          imageAlt: 'دانشجویان دانشگاه',
        },
        {
          type: 'regular',
          title: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی',
          description:
            'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی',
          imageSrc: defaultImagePath,
          imageAlt: 'نشست رسانه ای',
        },
        {
          type: 'regular',
          title: 'مصاحبه علمی و تخصصی جذب اعضای هیات علمی دانشگاه جامع انقلاب اسلامی',
          description: 'مصاحبه علمی و تخصصی جذب اعضای هیات علمی دانشگاه جامع انقلاب اسلامی',
          imageSrc: defaultImagePath,
          imageAlt: 'مصاحبه علمی',
        },
      ],
    },
    {
      id: '2',
      title: 'فراخوان های پژوهشی',
      buttonTitle: 'مشاهده همه',
      component: 'Notifications',
      items: [
        {
          pic: defaultImagePath,
          title:
            '۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه',
          description:
            'فراخوان پذیرش بدون آزمون استعدادهای درخشان در مقطع ارشد 1404-1405 دانشگاه جامع انقلاب اسلامی\n',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title:
            'فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title: 'ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title: 'مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title:
            '۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه',
          description:
            'فراخوان پذیرش بدون آزمون استعدادهای درخشان در مقطع ارشد 1404-1405 دانشگاه جامع انقلاب اسلامی',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title:
            'فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title: 'ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title: 'مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title:
            '۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه',
          description: 'فراخوان پذیرش بد جامع انقلاب اسلامی',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title:
            'فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title: 'ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
        {
          pic: defaultImagePath,
          title: 'مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی',
          description:
            'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...',
          date: '۲۱ اردیبهشت ۱۴۰۳',
        },
      ],
    },
    {
      id: '3',
      title: 'معرفی معاونت',
      component: 'IntroductionOfDeputy',
      description:
        'معاونت دانشجویی دانشگاه جامع انقلاب اسلامی، با هدف ایجاد محیطی پویا و حمایت‌گر برای دانشجویان، خدمات متنوعی در حوزه‌های رفاهی، فرهنگی، بهداشتی و مشاوره‌ای ارائه می‌دهد. این معاونت با تأمین امکاناتی مانند خوابگاه‌های مجهز، تغذیه سالم، بیمه درمانی و برنامه‌های فرهنگی، تلاش می‌کند تا دوران تحصیل دانشجویان را به تجربه‌ای ارزشمند تبدیل کند. حمایت از تشکل‌های دانشجویی، برگزاری اردوها، مسابقات و مراسم‌های مذهبی، از جمله فعالیت‌هایی است که به رشد شخصیتی و اجتماعی دانشجویان کمک می‌کند. همچنین، خدمات مشاوره‌ای در زمینه‌های تحصیلی، شغلی و روان‌شناختی به دانشجویان ارائه می‌شود تا در مواجهه با چالش‌ها راهنمایی لازم را دریافت کنند. معاونت دانشجویی با نگاهی آینده‌نگر و مبتنی بر ارزش‌های اسلامی، در تلاش است تا دانشجویان را به عنوان انسان‌هایی مسئولیت‌پذیر و تأثیرگذار در جامعه تربیت کند. دانشجویان می‌توانند برای دریافت خدمات و اطلاعات بیشتر به دفتر معاونت دانشجویی مراجعه یا از طریق سامانه‌های ارتباطی دانشگاه با این معاونت در تماس باشند.',
      video: '/Images/introductionOfTheDeputy/test.mp4',
      imagePath: defaultImagePath,
    },
    {
      id: '4',
      title: '',
      component: 'ThreeHorizontalBoxComponent',
      items: [
        {
          id: '0_ThreeHorizontalBoxComponent',
          title: 'امور سراها',
          items: [
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
          ],
        },
        {
          id: '1_ThreeHorizontalBoxComponent',
          title: 'امور صندوق رفاه',
          items: [
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
          ],
        },
        {
          id: '2_ThreeHorizontalBoxComponent',
          title: 'امور تغذیه',
          items: [
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
            {
              text: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب',
              date: '۱۴۰۳/۰۲/۲۰',
            },
          ],
        },
      ],
    },
  ];

  return (
    <div className=" h-full flex flex-col">
      <ComponentGenerator data={contentData.filter(item => item.isHero)} />

      <div className="w-full flex flex-col lg:gap-16 gap-8 mt-8 lg:mt-16 ">
        <ComponentGenerator data={contentData.filter(item => !item.isHero)} />
      </div>
    </div>
  );
}
