'use client'
import React, {useState} from "react";
import Slider from "../homePage/Components/Slider/Slider";
import Features from "../homePage/Components/Features/Features";
import LastNews from "../homePage/Components/LastNews/LastNews";
import WhyCuIr from "../homePage/Components/WhyCuIr/WhyCuIr";
import UniStats from "../homePage/Components/UniStats/UniStats";
import Notifications from "../homePage/Components/Notifications/Notifications";
import ResearchCenter from "../homePage/Components/ResearchCenter/ResearchCenter";
import Gallery from "../homePage/Components/Gallery/Gallery";
import IntroductionOfDeputy from "../homePage/Components/IntroductionOfDeputy/IntroductionOfDeputy";
import IntroductionOfWelfareServices from "../homePage/Components/IntroductionOfWelfareServices/IntroductionOfWelfareServices"
import NavBar from "../homePage/Components/NavBar/NavBar";
import Image from "next/image";
import Link from "next/link";

export default function HomePage() {
    const dummyNews = [
        {
            pic: "/Images/Hero.png",
            newstitle1: "رونمایی کتاب «کتاب شناسی اختصاصی غزّه»",
            desc1: "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، رونمایی کتاب «کتاب شناسی اختصاصی غزّه» به اهتمام دکتر سیّدحجّت الحق حسینی استاد دانشگاه صنعتی خواجه نصیرالدّین طوسی در تالار همایش های کوثر برگزار گردید.",
            pic2: "/Images/interview.png",
            newstitle2: "دانشجویان دانشگاه تراز انقلاب باید پژوهشگر باشند.",
            desc2: "دانشجویان دانشگاه تراز انقلاب باید پژوهشگر باشند. دکتر قدیانی رئیس دانشگاه جامع انقلاب اسلامی در شورای پژوهشی دانشگاه مطرح کرد:...",
            pic3: "/Images/interview.png",
            newstitle3: "نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی",
            desc3: "نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی"
        }
    ];

    const [NotificationsItems, setNotificationsItems] = useState([
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "فراخوان پذیرش بدون آزمون استعدادهای درخشان در مقطع ارشد 1404-1405 دانشگاه جامع انقلاب اسلامی\n",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard2.png"),
            title:
                "فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard3.png"),
            title:
                "ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },{
            pic: require("../../../public/Images/Notifications/imagecard4.png"),
            title:
                "مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },{
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "فراخوان پذیرش بدون آزمون استعدادهای درخشان در مقطع ارشد 1404-1405 دانشگاه جامع انقلاب اسلامی",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard2.png"),
            title:
                "فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard3.png"),
            title:
                "ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },{
            pic: require("../../../public/Images/Notifications/imagecard4.png"),
            title:
                "مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "فراخوان پذیرش بد جامع انقلاب اسلامی",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard2.png"),
            title:
                "فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard3.png"),
            title:
                "ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },{
            pic: require("../../../public/Images/Notifications/imagecard4.png"),
            title:
                "مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی",
            description:
                "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        }
    ]);

    const IntroductionOfWelfareServicesData ={
        title:"معرفی خدمات رفاهی دانشگاه جامع انقلاب اسلامی",
        items:[
            {
                img: "/Images/IntroductionOfWelfareServices/class.png",
                desc: "علاوه بر این، دانشگاه برای رفاه بیشتر دانشجویان، خدمات مشاوره‌ای و روانشناختی نیز ارائه می‌دهد. تیم‌های متخصص مشاوره در زمینه‌های تحصیلی، خانوادگی و روانی آماده کمک به دانشجویان هستند تا بتوانند چالش‌های مختلف را پشت سر بگذارند. همچنین، برنامه‌های فرهنگی و تفریحی متنوعی مانند اردوهای دانشجویی، کارگاه‌های آموزشی و مسابقات ورزشی به طور منظم برگزار می‌شود تا دانشجویان بتوانند در کنار تحصیل، از زندگی دانشجویی لذت ببرند.",
            },
            {
                img: "/Images/IntroductionOfWelfareServices/salon.png",
                desc: "دانشگاه جامع انقلاب اسلامی با هدف ارتقای کیفیت زندگی دانشجویان و کارکنان، خدمات رفاهی متنوع و جامعی ارائه می‌دهد. این خدمات شامل امکاناتی مانند خوابگاه‌های دانشجویی مجهز، سالن‌های غذاخوری با منوی متنوع و بهداشتی، و مراکز بهداشتی درمانی است که به صورت شبانه‌روزی آماده ارائه خدمات به دانشجویان هستند. همچنین، کتابخانه‌های مدرن، سالن‌های مطالعه و فضاهای ورزشی مجهز نیز در دسترس دانشجویان قرار دارد تا بتوانند در کنار تحصیل، از اوقات فراغت خود به بهترین شکل استفاده کنند.",
            },
            {
                img: "/Images/IntroductionOfWelfareServices/salon.png",
                desc: "دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.",
            },
            {
                img: "/Images/IntroductionOfWelfareServices/self.png",
                desc: "دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.",
            },
            {
                img: "/Images/IntroductionOfWelfareServices/class.png",
                desc: "علاوه بر این، دانشگاه برای رفاه بیشتر دانشجویان، خدمات مشاوره‌ای و روانشناختی نیز ارائه می‌دهد. تیم‌های متخصص مشاوره در زمینه‌های تحصیلی، خانوادگی و روانی آماده کمک به دانشجویان هستند تا بتوانند چالش‌های مختلف را پشت سر بگذارند. همچنین، برنامه‌های فرهنگی و تفریحی متنوعی مانند اردوهای دانشجویی، کارگاه‌های آموزشی و مسابقات ورزشی به طور منظم برگزار می‌شود تا دانشجویان بتوانند در کنار تحصیل، از زندگی دانشجویی لذت ببرند.",
            },
            {
                img: "/Images/IntroductionOfWelfareServices/salon.png",
                desc: "دانشگاه جامع انقلاب اسلامی با هدف ارتقای کیفیت زندگی دانشجویان و کارکنان، خدمات رفاهی متنوع و جامعی ارائه می‌دهد. این خدمات شامل امکاناتی مانند خوابگاه‌های دانشجویی مجهز، سالن‌های غذاخوری با منوی متنوع و بهداشتی، و مراکز بهداشتی درمانی است که به صورت شبانه‌روزی آماده ارائه خدمات به دانشجویان هستند. همچنین، کتابخانه‌های مدرن، سالن‌های مطالعه و فضاهای ورزشی مجهز نیز در دسترس دانشجویان قرار دارد تا بتوانند در کنار تحصیل، از اوقات فراغت خود به بهترین شکل استفاده کنند.",
            },
            {
                img: "/Images/IntroductionOfWelfareServices/salon.png",
                desc: "دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.",
            },
            {
                img: "/Images/IntroductionOfWelfareServices/self.png",
                desc: "دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.",
            }
        ]
    }


    return (
        <div dir="rtl" lang="fa" className=" h-full flex flex-col">
            <Slider />
            <Features />
            <LastNews newstitle={dummyNews} />
            <WhyCuIr />
            <UniStats />
            <Notifications items={NotificationsItems} />
            <ResearchCenter />
            <IntroductionOfWelfareServices title={IntroductionOfWelfareServicesData.title} items={IntroductionOfWelfareServicesData.items} />
            <IntroductionOfDeputy />
            <Gallery />
        </div>
    );
}