import ContactWithWeComponent from '@/components/DynamicComponents/ContactWithWe';

export default function ContactPage() {
  const contactSections = {
    className: ' mt-8 lg:mt-16',
    defaultImg:
      'https://s33.picofile.com/d/8484496634/60941f20-7f45-4804-b7a3-7df64bed45d4/placeholder.svg',
    items: [
      {
        title: 'روابط عمومی',
        items: [
          { title: 'مرکز روابط عمومی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دورنگار', desc: 'example@gmail.com' },
          { title: 'پست الکترونیک', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
        ],
      },
      {
        title: 'تماس با معاونت',
        items: [
          { title: 'مرکز تلفن دانشگاه', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دبیرخانه دفتر ریاست دانشگاه', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'ساعات کاری', desc: 'شنبه تا چهارشنبه، ۸:۰۰ تا ۱۶:۰۰' },
          { title: 'صندوق پستی', desc: '۱۱۲۲۳۳۴۴۵۵' },
          {
            title: 'آدرس دانشگاه',
            desc: 'تهران، میدان سپاه، خیابان ولیعصر(عج)، دانشگاه جامع انقلاب اسلامی',
          },
        ],
      },
      {
        title: 'تماس با معاونت‌ها',
        items: [
          { title: 'معاونت دانشجویی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'معاونت پژوهش و فناوری', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'معاونت فرهنگی و اجتماعی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'معاونت آموزشی و تحصیلات تکمیلی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'معاونت اداری و مالی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'معاونت فناوری', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'امور بین ‌الملل', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
        ],
      },
      {
        title: 'تماس با دانشکده‌ها',
        items: [
          { title: 'دانشکده مقاومت مردمی انقلاب اسلامی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دانشکده فرهنگ و هنر انقلاب اسلامی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دانشکده علوم انسانی و اسلامی انقلاب اسلامی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دانشکده سبک زندگی اسلامی ایرانی انقلاب اسلامی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دانشکده فناوری‌های نوین انقلاب اسلامی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دانشکده علوم بنیادی انقلاب اسلامی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دانشکده بهداشت و سلامت انقلاب اسلامی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
        ],
      },
      {
        title: 'زیرمجموعه‌های دانشگاه',
        items: [
          { title: 'خدمات آموزشی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'تحصیلات تکمیلی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دانش‌آموختگان', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'پذیرش و نظام وظیفه', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'کتابخانه مرکزی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'ارتباط با صنعت', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'صندوق رفاه دانشجویی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'آموزش‌های آزاد و الکترونیکی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'مركز رشد پارک علم و فناورى', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'دفتر کار و ارتباطات دانشجویی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'مرکز خدمات آزمایشگاهی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
          { title: 'امور ورزشی و تربیت بدنی', desc: '۰۲۱-۰۰۰۰-۰۰۰۰' },
        ],
      },
    ],
  };

  return (
    <div className="pt-20">
      <ContactWithWeComponent data={contactSections} />
    </div>
  );
}
