import NewsArticlePage from '../../../../components/DynamicComponents/NewsArticlePage';
import { defaultImagePath } from '../../../../constants/index';

export default function NewsPage() {
  const articlePageData = {
    headerZone: [
      {
        type: 'ARTICLE_FULL_HEADER',
        minutes: 8,
        title: 'بیداری اسلامی، تحولی جهانی در سایه انقلاب ایران',
        description: `ویژه برنامه دانشگاه جامع انقلاب اسلامی به مناسبت ایام الله دهه فجر و نیمه شعبان سردار
        محمد رضا نقدی: بیداری اسلامی، تحولی جهانی در سایه انقلاب ایران به گزارش روابط عمومی
        دانشگاه جامع انقلاب اسلامی، به مناسبت ایام الله دهه فجر، نیمه شعبان و آغاز ترم جدید،
        مراسمی در تاریخ سشنبه (۲۳ بهمن ماه) برگزار شد.`,
        imageUrl: defaultImagePath,
        altText: 'news image',
        publishDate: '۱۷ اردیبهشت ۱۴۰۴',
      },
    ],
    mainContentZone: [
      {
        type: 'SECTION_HEADING',
        title: 'مقدمه',
      },
      {
        type: 'PARAGRAPH',
        text: `این مراسم با حضور سردار محمد رضا نقدی، معاون هماهنگ کننده سپاه پاسداران، و شعرخوانی حاج
        محمد رسولی، رئیس دانشگاه و مسئولین و دانشجویان در سالن شهید ابومهدی المهندس برگزار
        گردید. سردار محمد رضا نقدی اظهار کرد:انقلاب، همه‌چیز است و دستاورد آن، آزادی و استقلال
        حاکمیت اسلامی بود که به ما رسید. ان‌شاءالله به پیروزی خواهیم رسید. خودشان مبحث
        دستاوردهای شیرین و لذت‌بخش را در بنگاه‌های اقتصادی مطرح می‌کنند و ما هم امیدواریم که به
        توفیق برسیم. پیروزی‌های درخشان امت اسلامی به دست آمده و این موعود که وعده داده شده، همه
        در انتظار او هستیم.`,
      },
      {
        type: 'IMAGE_WITH_CAPTION',
        imageUrl: defaultImagePath,
        altText: 'news image',
      },
      {
        type: 'PARAGRAPH',
        text: `وی در ادامه با اشاره به شعر خوانی حاج محمد رسولی افزودند :شعرهای زیبایی که برادرمان
        سروده‌اند، به ما یادآوری می‌کند که خداوند بارها وعده داده و عمل کرده است. وعده آمدن حضرت
        موسی (ع) نیز به بنی‌اسرائیل داده شده بود. این موضوع حتی در خواب‌های برخی از ما نیز دیده
        شده است. محققان به این ماجرا پرداخته‌اند و می‌گویند که چیزی باید بلند شود تا بر سر ما
        بیفتد. به همین دلیل، نوزادان را می‌کشتند، مثل قیام حضرت عیسی (ع) در زمان ارادتش.`,
      },
      {
        type: 'QUOTE_BLOCK',
        quoteText: `ما این موضوع را تجربه کرده‌ایم. ما یک امام غائب داشتیم که نوزده سال از مغول آمد و ظهور
        کرد و این منجی آخرالزمان ان‌شاءالله به همان ترتیب خواهد آمد. اگر می‌خواهیم در ظهور
        نقشی داشته باشیم، باید همان‌طور که ایران را برای ظهور آماده کردیم، اهتمام کنیم و در
        تبعید نیز توانایی ایجاد آمادگی در جامعه بشری برای چنین استقبالی را فراهم کنیم.`,
        attribution: 'سردار محمد رضا نقدی',
      },
      {
        type: 'PARAGRAPH',
        text: `وی ادامه داد:امروز دنیا بیدار شده و تحولی بزرگ در جهان رقم خورده که نظیر ندارد. به جز
        نهضت‌های انبیا، هیچ مثالی برای این تحول وجود ندارد. آنچه امروز در عالم در حال وقوع است،
        در قرون گذشته هرگز اتفاق نیفتاده است...`,
      },
      {
        type: 'SECTION_HEADING',
        title: 'مقدمه',
      },
      {
        type: 'PARAGRAPH',
        text: `این مراسم با حضور سردار محمد رضا نقدی، معاون هماهنگ کننده سپاه پاسداران...`,
      },
      {
        type: 'IMAGE_WITH_CAPTION',
        imageUrl: defaultImagePath,
        altText: 'news image',
        caption: `ویژه برنامه دانشگاه جامع انقلاب اسلامی به مناسبت ایام الله دهه فجر و نیمه شعبان سردار
        محمد رضا نقدی`,
      },
      {
        type: 'SECTION_HEADING',
        title: 'مقدمه',
      },
      {
        type: 'PARAGRAPH',
        text: `این مراسم با حضور سردار محمد رضا نقدی، معاون هماهنگ کننده سپاه پاسداران، و شعرخوانی حاج
          محمد رسولی، رئیس دانشگاه و مسئولین و دانشجویان در سالن شهید ابومهدی المهندس برگزار
          گردید. سردار محمد رضا نقدی اظهار کرد:انقلاب، همه‌چیز است و دستاورد آن، آزادی و استقلال
          حاکمیت اسلامی بود که به ما رسید. ان‌شاءالله به پیروزی خواهیم رسید. خودشان مبحث
          دستاوردهای شیرین و لذت‌بخش را در بنگاه‌های اقتصادی مطرح می‌کنند و ما هم امیدواریم که به
          توفیق برسیم. پیروزی‌های درخشان امت اسلامی به دست آمده و این موعود که وعده داده شده، همه
          در انتظار او هستیم.`,
      },
      {
        type: 'SECTION_HEADING',
        title: 'مقدمه',
      },
      {
        type: 'PARAGRAPH',
        text: `این مراسم با حضور سردار محمد رضا نقدی، معاون هماهنگ کننده سپاه پاسداران، و شعرخوانی حاج
          محمد رسولی، رئیس دانشگاه و مسئولین و دانشجویان در سالن شهید ابومهدی المهندس برگزار
          گردید. سردار محمد رضا نقدی اظهار کرد:انقلاب، همه‌چیز است و دستاورد آن، آزادی و استقلال
          حاکمیت اسلامی بود که به ما رسید. ان‌شاءالله به پیروزی خواهیم رسید. خودشان مبحث
          دستاوردهای شیرین و لذت‌بخش را در بنگاه‌های اقتصادی مطرح می‌کنند و ما هم امیدواریم که به
          توفیق برسیم. پیروزی‌های درخشان امت اسلامی به دست آمده و این موعود که وعده داده شده، همه
          در انتظار او هستیم.`,
      },
      {
        type: 'QUOTE_BLOCK',
        quoteText: `ما این موضوع را تجربه کرده‌ایم. ما یک امام غائب داشتیم که نوزده سال از مغول آمد و ظهور
          کرد و این منجی آخرالزمان ان‌شاءالله به همان ترتیب خواهد آمد. اگر می‌خواهیم در ظهور
          نقشی داشته باشیم، باید همان‌طور که ایران را برای ظهور آماده کردیم، اهتمام کنیم و در
          تبعید نیز توانایی ایجاد آمادگی در جامعه بشری برای چنین استقبالی را فراهم کنیم.`,
        attribution: 'سردار محمد رضا نقدی',
      },
      {
        type: 'IMAGE_WITH_CAPTION',
        imageUrl: defaultImagePath,
        altText: 'news image',
      },
      {
        type: 'PARAGRAPH',
        text: `این مراسم با حضور سردار محمد رضا نقدی، معاون هماهنگ کننده سپاه پاسداران، و شعرخوانی حاج
          محمد رسولی، رئیس دانشگاه و مسئولین و دانشجویان در سالن شهید ابومهدی المهندس برگزار
          گردید. سردار محمد رضا نقدی اظهار کرد:انقلاب، همه‌چیز است و دستاورد آن، آزادی و استقلال
          حاکمیت اسلامی بود که به ما رسید. ان‌شاءالله به پیروزی خواهیم رسید. خودشان مبحث
          دستاوردهای شیرین و لذت‌بخش را در بنگاه‌های اقتصادی مطرح می‌کنند و ما هم امیدواریم که به
          توفیق برسیم. پیروزی‌های درخشان امت اسلامی به دست آمده و این موعود که وعده داده شده، همه
          در انتظار او هستیم.`,
      },
      {
        type: 'PARAGRAPH',
        text: `این مراسم با حضور سردار محمد رضا نقدی، معاون هماهنگ کننده سپاه پاسداران، و شعرخوانی حاج
          محمد رسولی، رئیس دانشگاه و مسئولین و دانشجویان در سالن شهید ابومهدی المهندس برگزار
          گردید. سردار محمد رضا نقدی اظهار کرد:انقلاب، همه‌چیز است و دستاورد آن، آزادی و استقلال
          حاکمیت اسلامی بود که به ما رسید. ان‌شاءالله به پیروزی خواهیم رسید. خودشان مبحث
          دستاوردهای شیرین و لذت‌بخش را در بنگاه‌های اقتصادی مطرح می‌کنند و ما هم امیدواریم که به
          توفیق برسیم. پیروزی‌های درخشان امت اسلامی به دست آمده و این موعود که وعده داده شده، همه
          در انتظار او هستیم.`,
      },
      {
        type: 'PARAGRAPH',
        text: `این مراسم با حضور سردار محمد رضا نقدی، معاون هماهنگ کننده سپاه پاسداران، و شعرخوانی حاج
          محمد رسولی، رئیس دانشگاه و مسئولین و دانشجویان در سالن شهید ابومهدی المهندس برگزار
          گردید. سردار محمد رضا نقدی اظهار کرد:انقلاب، همه‌چیز است و دستاورد آن، آزادی و استقلال
          حاکمیت اسلامی بود که به ما رسید. ان‌شاءالله به پیروزی خواهیم رسید. خودشان مبحث
          دستاوردهای شیرین و لذت‌بخش را در بنگاه‌های اقتصادی مطرح می‌کنند و ما هم امیدواریم که به
          توفیق برسیم. پیروزی‌های درخشان امت اسلامی به دست آمده و این موعود که وعده داده شده، همه
          در انتظار او هستیم.`,
      },
    ],
  };

  return (
    <div className="lg:mt-36">
      <NewsArticlePage data={articlePageData} />
    </div>
  );
}
