'use client';
import React from 'react';

import WhyCuIrSection from '../homePage/Components/NewLastNews';
import TwoColumnGalleryComponent from '../../components/DynamicComponents/TwoColumnGallery';
import backImage from '../../../public/Images/FooterIcons/BgResearch.jpg';
import GalleryComponent from '../../components/DynamicComponents/Gallery';
import IntroductionOfDeputyComponent from '../../components/DynamicComponents/IntroductionOfDeputy';
import NotificationsComponent from '../../components/DynamicComponents/Notifications';
import LastNewsComponent from '../../components/DynamicComponents/LastNews';
import FeaturesComponent from '../../components/DynamicComponents/Features';
import FullScreenSliderComponent from '../../components/DynamicComponents/FullSlider';
import UniversityStatsComponent from '../../components/DynamicComponents/UniversityStats';

export default function HomePage() {
  const introductionOfWelfareServicesData = {
    title: 'معرفی خدمات رفاهی دانشگاه جامع انقلاب اسلامی',
    description: '',
    backgroundImagePath: backImage,
    items: [
      {
        img: '/Images/IntroductionOfWelfareServices/class.png',
        desc: ' علاوه بر این، دانشگاه برای رفاه بیشتر دانشجویان، خدمات مشاوره‌ای و روانشناختی نیز ارائه می‌دهد. تیم‌های متخصص مشاوره در زمینه‌های تحصیلی، خانوادگی و روانی آماده کمک به دانشجویان هستند تا بتوانند چالش‌های مختلف را پشت سر بگذارند. همچنین، برنامه‌های فرهنگی و تفریحی متنوعی مانند اردوهای دانشجویی، کارگاه‌های آموزشی و مسابقات ورزشی به طور منظم برگزار می‌شود تا دانشجویان بتوانند در کنار تحصیل، از زندگی دانشجویی لذت ببرند. علاوه بر این، دانشگاه برای رفاه بیشتر دانشجویان، خدمات مشاوره‌ای و روانشناختی نیز ارائه می‌دهد. تیم‌های متخصص مشاوره در زمینه‌های تحصیلی، خانوادگی و روانی آماده کمک به دانشجویان هستند تا بتوانند چالش‌های مختلف را پشت سر بگذارند. همچنین، برنامه‌های فرهنگی و تفریحی متنوعی مانند اردوهای دانشجویی، کارگاه‌های آموزشی و مسابقات ورزشی به طور منظم برگزار می‌شود تا دانشجویان بتوانند در کنار تحصیل، از زندگی دانشجویی لذت ببرند.علاوه بر این، دانشگاه برای رفاه بیشتر دانشجویان، خدمات مشاوره‌ای و روانشناختی نیز ارائه می‌دهد. تیم‌های متخصص مشاوره در زمینه‌های تحصیلی، خانوادگی و روانی آماده کمک به دانشجویان هستند تا بتوانند چالش‌های مختلف را پشت سر بگذارند. همچنین، برنامه‌های فرهنگی و تفریحی متنوعی مانند اردوهای دانشجویی، کارگاه‌های آموزشی و مسابقات ورزشی به طور منظم برگزار می‌شود تا دانشجویان بتوانند در کنار تحصیل، از زندگی دانشجویی لذت ببرند.',
      },
      {
        img: '/Images/IntroductionOfWelfareServices/salon.png',
        desc: 'دانشگاه جامع انقلاب اسلامی با هدف ارتقای کیفیت زندگی دانشجویان و کارکنان، خدمات رفاهی متنوع و جامعی ارائه می‌دهد. این خدمات شامل امکاناتی مانند خوابگاه‌های دانشجویی مجهز، سالن‌های غذاخوری با منوی متنوع و بهداشتی، و مراکز بهداشتی درمانی است که به صورت شبانه‌روزی آماده ارائه خدمات به دانشجویان هستند. همچنین، کتابخانه‌های مدرن، سالن‌های مطالعه و فضاهای ورزشی مجهز نیز در دسترس دانشجویان قرار دارد تا بتوانند در کنار تحصیل، از اوقات فراغت خود به بهترین شکل استفاده کنند.',
      },
      {
        img: '/Images/IntroductionOfWelfareServices/salon.png',
        desc: 'دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.',
      },
      {
        img: '/Images/IntroductionOfWelfareServices/self.png',
        desc: 'دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.',
      },
      {
        img: '/Images/IntroductionOfWelfareServices/class.png',
        desc: 'علاوه بر این، دانشگاه برای رفاه بیشتر دانشجویان، خدمات مشاوره‌ای و روانشناختی نیز ارائه می‌دهد. تیم‌های متخصص مشاوره در زمینه‌های تحصیلی، خانوادگی و روانی آماده کمک به دانشجویان هستند تا بتوانند چالش‌های مختلف را پشت سر بگذارند. همچنین، برنامه‌های فرهنگی و تفریحی متنوعی مانند اردوهای دانشجویی، کارگاه‌های آموزشی و مسابقات ورزشی به طور منظم برگزار می‌شود تا دانشجویان بتوانند در کنار تحصیل، از زندگی دانشجویی لذت ببرند.',
      },
      {
        img: '/Images/IntroductionOfWelfareServices/salon.png',
        desc: 'دانشگاه جامع انقلاب اسلامی با هدف ارتقای کیفیت زندگی دانشجویان و کارکنان، خدمات رفاهی متنوع و جامعی ارائه می‌دهد. این خدمات شامل امکاناتی مانند خوابگاه‌های دانشجویی مجهز، سالن‌های غذاخوری با منوی متنوع و بهداشتی، و مراکز بهداشتی درمانی است که به صورت شبانه‌روزی آماده ارائه خدمات به دانشجویان هستند. همچنین، کتابخانه‌های مدرن، سالن‌های مطالعه و فضاهای ورزشی مجهز نیز در دسترس دانشجویان قرار دارد تا بتوانند در کنار تحصیل، از اوقات فراغت خود به بهترین شکل استفاده کنند.',
      },
      {
        img: '/Images/IntroductionOfWelfareServices/salon.png',
        desc: 'دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.',
      },
      {
        img: '/Images/IntroductionOfWelfareServices/self.png',
        desc: 'دانشگاه جامع انقلاب اسلامی همچنین به دنبال ایجاد محیطی امن و پویا برای دانشجویان است. خدمات ویژه‌ای مانند کلاس‌های زبان ، مشاوره‌های اختصاصی برای دانشجویان و برنامه‌های فرهنگی برای آشنایی با فرهنگ ایران در نظر گرفته شده است. این دانشگاه با تأکید بر اهمیت رفاه و آسایش دانشجویان، همواره در تلاش است تا با به‌روزرسانی و توسعه خدمات خود، محیطی مناسب برای رشد علمی و شخصی افراد فراهم کند.',
      },
    ],
  };
  const whyCuIrData = {
    title: 'دانشگاه جامع انقلاب اسلامی',
    description:
      '   دانشگاه جامع انقلاب اسلامی با تکیه بر ارزش‌های اسلامی و نوآوری، به تربیت نیروهای متخصص و تمدن‌ساز برای آینده ایران متعهد است. ',
    items: [
      {
        id: 1,
        title: 'تمدن‌ساز',
        content:
          'دانشگاه با شعار "تمدن‌ساز"، با ترکیب دانش روز و ارزش‌های اسلامی، پایه‌های تمدن نوین اسلامی را بنیان می‌نهد و با تربیت انسان‌های آگاه، به ساختن آینده‌ای متعالی برای ایران و جهان اسلام کمک می‌کند.',
      },
      {
        id: 2,
        title: 'تمدن‌ساز',
        content:
          'دانشگاه با شعار "تمدن‌ساز"، با ترکیب دانش روز و ارزش‌های اسلامی، پایه‌های تمدن نوین اسلامی را بنیان می‌نهد و با تربیت انسان‌های آگاه، به ساختن آینده‌ای متعالی برای ایران و جهان اسلام کمک می‌کند.',
      },
      {
        id: 3,
        title: 'نوآور',
        content:
          'دانشگاه جامع انقلاب اسلامی با شعار "نوآور"، از آخرین دستاوردهای علمی و فناوری بهره می‌گیرد تا فضایی پویا و خلاق برای دانشجویان ایجاد کند و با حمایت از ایده‌های نو، به پرورش نسل آینده متفکران و مخترعان کمک کند.',
      },
    ],
    videoPath: '',
    videoImagePath: '/Images/Gallery/1.png',
  };
  const introductionOfDeputyData = {
    title: 'معرفی معاونت',
    description:
      'معاونت دانشجویی دانشگاه جامع انقلاب اسلامی، با هدف ایجاد محیطی پویا و حمایت‌گر برای دانشجویان، خدمات متنوعی در حوزه‌های رفاهی، فرهنگی، بهداشتی و مشاوره‌ای ارائه می‌دهد. این معاونت با تأمین امکاناتی مانند خوابگاه‌های مجهز، تغذیه سالم، بیمه درمانی و برنامه‌های فرهنگی، تلاش می‌کند تا دوران تحصیل دانشجویان را به تجربه‌ای ارزشمند تبدیل کند. حمایت از تشکل‌های دانشجویی، برگزاری اردوها، مسابقات و مراسم‌های مذهبی، از جمله فعالیت‌هایی است که به رشد شخصیتی و اجتماعی دانشجویان کمک می‌کند. همچنین، خدمات مشاوره‌ای در زمینه‌های تحصیلی، شغلی و روان‌شناختی به دانشجویان ارائه می‌شود تا در مواجهه با چالش‌ها راهنمایی لازم را دریافت کنند. معاونت دانشجویی با نگاهی آینده‌نگر و مبتنی بر ارزش‌های اسلامی، در تلاش است تا دانشجویان را به عنوان انسان‌هایی مسئولیت‌پذیر و تأثیرگذار در جامعه تربیت کند. دانشجویان می‌توانند برای دریافت خدمات و اطلاعات بیشتر به دفتر معاونت دانشجویی مراجعه یا از طریق سامانه‌های ارتباطی دانشگاه با این معاونت در تماس باشند.',
    video: '/Images/introductionOfTheDeputy/test.mp4',
    imagePath: '/Images/IntroductionOfWelfareServices/salon.png',
  };
  const galleryData = {
    sections: [
      { id: 1, name: 'زندگی در دانشگاه' },
      { id: 2, name: 'مصاحبه جذب هیئت علمی' },
      { id: 3, name: 'بسیج دانشجویی' },
      { id: 4, name: 'ثبت نام دانشجویان' },
    ],
    items: [
      {
        img: '/images/Gallery/1.png',
        title: 'ثبت نام دانشجو مقطه کارشناسی ارشد 1403-1404',
        date: '1402/12/01',
      },
      {
        img: '/images/Gallery/2.png',
        title: 'جذب هیئت علمی',
        date: '1402/12/01',
      },
      {
        img: '/images/Gallery/3.png',
        title: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی',
        date: '1402/12/01',
      },
      {
        img: '/images/Gallery/4.png',
        title: 'ثبت نام دانشجو مقطه کارشناسی ارشد 1403-1404',
        date: '1402/12/01',
      },
      {
        img: '/images/Gallery/1.png',
        title: 'جذب هیئت علمی',
        date: '1402/12/01',
      },
      {
        img: '/images/Gallery/2.png',
        title: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی',
        date: '1402/12/01',
      },
      {
        img: '/images/Gallery/3.png',
        title: 'ثبت نام دانشجو مقطه کارشناسی ارشد 1403-1404',
        date: '1402/12/01',
      },
      {
        img: '/images/Gallery/4.png',
        title: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی',
        date: '1402/12/01',
      },
    ],
    title: 'فیلم و عکس',
    description: '',
    buttonTitle: 'مشاهده تصاویر و ویدیوها',
  };
  const notificationsData = {
    title: 'اطلاعیه ها',
    buttonTitle: 'مشاهده همه',
    items: [
      {
        pic: require('../../../public/Images/Notifications/imagecard.png'),
        title:
          '۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه',
        description:
          'فراخوان پذیرش بدون آزمون استعدادهای درخشان در مقطع ارشد 1404-1405 دانشگاه جامع انقلاب اسلامی\n',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard2.png'),
        title:
          'فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard3.png'),
        title: 'ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard4.png'),
        title: 'مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard.png'),
        title:
          '۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه',
        description:
          'فراخوان پذیرش بدون آزمون استعدادهای درخشان در مقطع ارشد 1404-1405 دانشگاه جامع انقلاب اسلامی',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard2.png'),
        title:
          'فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard3.png'),
        title: 'ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard4.png'),
        title: 'مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard.png'),
        title:
          '۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه',
        description: 'فراخوان پذیرش بد جامع انقلاب اسلامی',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard2.png'),
        title:
          'فرآیند ثبت نام دانشجویان در گفتگو با مدیر تحصیلات تکمیلی دانشگاه جامع انقلاب اسلامی',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، به نقل از سرکار خانم دکتر عزیزپوریان مدیر تحصیلات تکمیلی این دانشگاه در گفتگو با خبرنگار دانشگاه مطرح کردند',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard3.png'),
        title: 'ثبت نام دانشجویان مقطع کارشناسی ارشد 1404-1403',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی ، ثبت نام دانشجویان مقطع کارشناسی ارشد این دانشگاه آغاز شد ',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
      {
        pic: require('../../../public/Images/Notifications/imagecard4.png'),
        title: 'مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی،مراسم گرامیداشت روز دانشجو در دانشگاه جامع انقلاب اسلامی با حضور جناب آقای دکتر سعید عزیزی، کارشناس...',
        date: '۲۱ اردیبهشت ۱۴۰۳',
      },
    ],
  };
  const lastNewsData = {
    type: 'horizontal',
    header: {
      title: 'آخرین اخبار دانشگاه',
      description: 'برای اطلاع از آخرین اخبار به پرتال خبری دانشگاه مراجعه کنید.',
      portalLink: '#',
    },
    news: [
      {
        type: 'featured',
        title:
          'رونمایی کتاب «کتاب شناسی اختصاصی غزه» به اهتمام دکتر سیدحجت الحق حسینی استاد دانشگاه صنعتی خواجه نصیرالدین طوسی',
        description:
          'به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، رونمایی کتاب «کتاب شناسی اختصاصی غزه» به اهتمام دکتر سیدحجت الحق حسینی استاد دانشگاه صنعتی خواجه نصیرالدین طوسی در تالار همایش های کوثر برگزار گردید.',
        imageSrc: '/Images/Skeletons/placeholder.svg?height=300&width=400',
        imageAlt: 'کتاب شناسی اختصاصی غزه',
      },
      {
        type: 'regular',
        title: 'دانشجویان دانشگاه تراز انقلاب باید پژوهشگر باشند.',
        description:
          'دکتر قیدانی رئیس دانشگاه جامع انقلاب اسلامی در شورای پژوهشی دانشگاه مطرح کرد...',
        imageSrc: '/Images/Skeletons/placeholder.svg?height=300&width=400',
        imageAlt: 'دانشجویان دانشگاه',
      },
      {
        type: 'regular',
        title: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی',
        description: 'نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی',
        imageSrc: '/Images/Skeletons/placeholder.svg?height=300&width=400',
        imageAlt: 'نشست رسانه ای',
      },
      {
        type: 'regular',
        title: 'مصاحبه علمی و تخصصی جذب اعضای هیات علمی دانشگاه جامع انقلاب اسلامی',
        description: 'مصاحبه علمی و تخصصی جذب اعضای هیات علمی دانشگاه جامع انقلاب اسلامی',
        imageSrc: '/Images/Skeletons/placeholder.svg?height=300&width=400',
        imageAlt: 'مصاحبه علمی',
      },
    ],
  };
  const UniversityStatsData = {
    title: '',
    description: '',
    stats: [
      { img: '/Images/Skeletons/placeholder.svg', text: '4 دانشکده' },
      { img: '/Images/Skeletons/placeholder.svg', text: '100 فارغ التحصیل' },
      { img: '/Images/Skeletons/placeholder.svg', text: '120 مقاله چاپ شده' },
      { img: '/Images/Skeletons/placeholder.svg', text: '40 رشته آموزشی' },
      { img: '/Images/Skeletons/placeholder.svg', text: '476 دانشجوی ارشد و دکتری' },
      { img: '/Images/Skeletons/placeholder.svg', text: '50 عضو هیئت علمی' },
    ],
  };
  const featuresData = {
    title: '',
    items: [
      {
        name: 'سامانه آموزش بهستان',
        image: '/images/Features/1.svg',
      },
      {
        name: 'سامانه کتابخانه',
        image: '/images/Features/2.svg',
      },
      {
        name: 'صندوق رفاه دانشجویی',
        image: '/images/Features/3.svg',
      },
      {
        name: 'سامانه تغذیه',
        image: '/images/Features/4.svg',
      },
      {
        name: 'تقویم تحصیلی',
        image: '/images/Features/5.svg',
      },
      {
        name: 'سامانه آموزش بهستان',
        image: '/images/Features/1.svg',
      },
      {
        name: 'سامانه کتابخانه',
        image: '/images/Features/2.svg',
      },
      {
        name: 'صندوق رفاه دانشجویی',
        image: '/images/Features/3.svg',
      },
      {
        name: 'سامانه تغذیه',
        image: '/images/Features/4.svg',
      },
      {
        name: 'تقویم تحصیلی',
        image: '/images/Features/5.svg',
      },
    ],
  };

  return (
    <div className=" h-full flex flex-col ">
      <FullScreenSliderComponent />
      <FeaturesComponent data={featuresData} />
      <div className="h-full flex flex-col lg:gap-16 gap-8 pt-16">
        <LastNewsComponent data={lastNewsData} />
        <WhyCuIrSection data={whyCuIrData} />
        <UniversityStatsComponent data={UniversityStatsData} />
        <NotificationsComponent data={notificationsData} />
        <TwoColumnGalleryComponent data={introductionOfWelfareServicesData} />
        <IntroductionOfDeputyComponent data={introductionOfDeputyData} />
        <GalleryComponent data={galleryData} />
      </div>
    </div>
  );
}
