'use client';
// import { redirect } from 'next/navigation';
import LastNews from './Component/LastNews';
import WhyCuir from './Component/WhyCuir';
import Uniinonelook from './Component/uniinonelook';
import NewsSection from "./Component/NewsSection";
const dummyNews = [
    {
        pic: "/Images/interview.png",
        newstitle1: "رونمایی کتاب «کتاب شناسی اختصاصی غزّه» به اهتمام دکتر سیّدحجّت الحق حسینی استاد دانشگاه صنعتی خواجه نصیرالدّین طوسی",
        desc1: "به گزارش روابط عمومی دانشگاه جامع انقلاب اسلامی، رونمایی کتاب «کتاب شناسی اختصاصی غزّه» به اهتمام دکتر سیّدحجّت الحق حسینی استاد دانشگاه صنعتی خواجه نصیرالدّین طوسی در تالار همایش های کوثر برگزار گردید.",
        pic2: "/Images/interview.png",
        newstitle2: "دانشجویان دانشگاه تراز انقلاب باید پژوهشگر باشند.",
        desc2: "دانشجویان دانشگاه تراز انقلاب باید پژوهشگر باشند. دکتر قدیانی رئیس دانشگاه جامع انقلاب اسلامی در شورای پژوهشی دانشگاه مطرح کرد:...",
        pic3: "/Images/interview.png",
        newstitle3: "نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی",
        desc3: "نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی",
        pic4: "/Images/interview.png",
        newstitle4: "نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی",
        desc4: "نشست رسانه ای تهران در مرکز همایش های بین المللی دانشگاه جامع انقلاب اسلامی"
    }
];
const data=[{
    innovative: "نوآور",
    innovativedesc: "دانشگاه جامع انقلاب اسلامی با شعار \"نوآور\"، همواره در تلاش است تا با بهره‌گیری از آخرین دستاوردهای علمی و فناوری، فضایی پویا و خلاق برای دانشجویان و پژوهشگران فراهم کند. این دانشگاه با تشویق به تفکر خارج از چارچوب‌های سنتی و حمایت از ایده‌های نو، به پرورش نسل آینده‌ی متفکران و مخترعان کشور می‌پردازد. نوآوری در این دانشگاه تنها به معنای پیشرفت تکنولوژیکی نیست، بلکه شامل ایجاد تحول در روش‌های آموزشی، پژوهشی و مدیریتی نیز می‌شود تا بتواند پاسخگوی نیازهای جامعه در عصر حاضر باشد.",
    Transformational: "تحول گرا",
    Transformationaldesc: "شعار \"تحول گرا\" در دانشگاه جامع انقلاب اسلامی بیانگر تعهد این نهاد به ایجاد تغییرات مثبت و پایدار در جامعه است. این دانشگاه با نگاهی آینده‌نگر و با تکیه بر ارزش‌های اسلامی و انقلابی، درصدد است تا با تربیت نیروهای متخصص و متعهد، زمینه‌ساز تحولات اساسی در عرصه‌های علمی، فرهنگی و اجتماعی شود. تحول‌گرایی در این دانشگاه به معنای حرکت به سمت تعالی و پیشرفت در تمامی ابعاد است، به گونه‌ای که بتواند الگویی برای سایر مراکز علمی و آموزشی در سطح ملی و بین‌المللی باشد.",
    civilizationmaker: "تمدن ساز",
    civilizationmakerdesc: "دانشگاه جامع انقلاب اسلامی با شعار \"تمدن ساز\"، رسالت خود را ایجاد پایه‌های تمدن نوین اسلامی می‌داند. این دانشگاه با تأکید بر نقش علم و دانش در شکل‌گیری تمدن‌ها، در تلاش است تا با ترکیب دانش روز و ارزش‌های اسلامی، گام‌های مؤثری در جهت پیشرفت جامعه بردارد. تمدن‌سازی در این دانشگاه به معنای ایجاد جامعه‌ای است که در آن عدالت، اخلاق، علم و معنویت در کنار یکدیگر قرار گرفته و الگویی برای جهانیان ارائه می‌دهد. این دانشگاه با تربیت انسان‌هایی آگاه، مسئول و متعهد، به ساختن آینده‌ای روشن و متعالی برای ایران و جهان اسلام کمک می‌کند. "
}
]

export default function Home() {

    return <>
        <div>
            <LastNews newstitle={dummyNews}/>
            <WhyCuir data={data}/>
            <Uniinonelook/>
<NewsSection  />
        </div>
    </>;

}


