"use client";
import "../globals.css";
import {useState} from "react";

import FontSizeSlider from "./Components/FontSizeSlider.jsx";



export default function Danial() {


    const [NotificationsItems, setNotificationsItems] = useState([
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
        {
            pic: require("../../../public/Images/Notifications/imagecard.png"),
            title:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            description:
                "۱۵ رشته جدید مقطع کارشناسی ارشد دانشگاه جامع انقلاب اسلامی در اصلاحیه سازمان سنجش + دفترچه",
            date: "۲۱ اردیبهشت ۱۴۰۳",
        },
    ]);


    const [IntroductionOftheDeputyData, setIntroductionOftheDeputyData] = useState({
        description: "معاونت دانشجویی دانشگاه جامع انقلاب اسلامی، با هدف ایجاد محیطی پویا و حمایت‌گر برای دانشجویان، خدمات متنوعی در حوزه‌های رفاهی، فرهنگی، بهداشتی و مشاوره‌ای ارائه می‌دهد. این معاونت با تأمین امکاناتی مانند خوابگاه‌های مجهز، تغذیه سالم، بیمه درمانی و برنامه‌های فرهنگی، تلاش می‌کند تا دوران تحصیل دانشجویان را به تجربه‌ای ارزشمند تبدیل کند. حمایت از تشکل‌های دانشجویی، برگزاری اردوها، مسابقات و مراسم‌های مذهبی، از جمله فعالیت‌هایی است که به رشد شخصیتی و اجتماعی دانشجویان کمک می‌کند. همچنین، خدمات مشاوره‌ای در زمینه‌های تحصیلی، شغلی و روان‌شناختی به دانشجویان ارائه می‌شود تا در مواجهه با چالش‌ها راهنمایی لازم را دریافت کنند. معاونت دانشجویی با نگاهی آینده‌نگر و مبتنی بر ارزش‌های اسلامی، در تلاش است تا دانشجویان را به عنوان انسان‌هایی مسئولیت‌پذیر و تأثیرگذار در جامعه تربیت کند. دانشجویان می‌توانند برای دریافت خدمات و اطلاعات بیشتر به دفتر معاونت دانشجویی مراجعه یا از طریق سامانه‌های ارتباطی دانشگاه با این معاونت در تماس باشند.",
        pic: "/Images/introductionOfTheDeputy/VideoPlayer.png"
    });

    return (
        <div dir="rtl" className=" h-base ">
        <FontSizeSlider />
            <IntroductionOfWelfareServices />
            <IntroductionOfTheDeputy info={IntroductionOftheDeputyData} />
            <Notifications items={NotificationsItems} />
            <ResearchCenter />
            <UpperFooter />
            <LowerFooter />

        </div>
    )
}